ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_MCU_NRF51822/source/nRF5xGap.cpp
                BLE_ERROR_PARAM_OUT_OF_RANGE
                The size of the supplied whitelist exceeds the maximum
                capacity of the implementation's internal whitelist.

    @section EXAMPLE

    @code

    @endcode
*/
/**************************************************************************/
ble_error_t nRF5xGap::setWhitelist(const Gap::Whitelist_t &whitelistIn)
{
    if (whitelistIn.size > getMaxWhitelistSize()) {
        return BLE_ERROR_PARAM_OUT_OF_RANGE;
    }

    /* Test for invalid parameters before we change the internal state */
    for (uint8_t i = 0; i < whitelistIn.size; ++i) {
        if (whitelistIn.addresses[i].type == BLEProtocol::AddressType::RANDOM_PRIVATE_NON_RESOLVABLE) {
            /* This is not allowed because it is completely meaningless */
            return BLE_ERROR_INVALID_PARAM;
        }
    }

    whitelistAddressesSize = 0;
    for (uint8_t i = 0; i < whitelistIn.size; ++i) {
        memcpy(&whitelistAddresses[whitelistAddressesSize], &whitelistIn.addresses[i], sizeof(BLEProtocol::Address_t));
        whitelistAddressesSize++;
    }

    return BLE_ERROR_NONE;
}

/**************************************************************************/
/*!
    @brief  Set the advertising policy filter mode that will be used in
            the next call to startAdvertising().

    @returns    \ref ble_errror_t

    @retval     BLE_ERROR_NONE
                Everything executed properly.

                BLE_ERROR_NOT_IMPLEMENTED
                This feature is currently note implemented.

    @section EXAMPLE

    @code

    @endcode
*/
/**************************************************************************/
ble_error_t nRF5xGap::setAdvertisingPolicyMode(Gap::AdvertisingPolicyMode_t mode)
{
    advertisingPolicyMode = mode;

    return BLE_ERROR_NONE;
}

/**************************************************************************/
/*!
    @brief  Set the scanning policy filter mode that will be used in
            the next call to startAdvertising().

    @returns    \ref ble_errror_t

    @retval     BLE_ERROR_NONE
                Everything executed properly.

                BLE_ERROR_NOT_IMPLEMENTED
                This feature is currently note implemented.

    @section EXAMPLE

    @code

    @endcode
*/
/**************************************************************************/
ble_error_t nRF5xGap::setScanningPolicyMode(Gap::ScanningPolicyMode_t mode)
{
    scanningPolicyMode = mode;

    return BLE_ERROR_NONE;
}

/**************************************************************************/
/*!
    @brief  Set the initiator policy filter mode that will be used in
            the next call to startAdvertising()

    @returns    \ref ble_errror_t

    @retval     BLE_ERROR_NONE
                Everything executed properly.

                BLE_ERROR_NOT_IMPLEMENTED
                This feature is currently note implemented.

    @section EXAMPLE

    @code

    @endcode
*/
/**************************************************************************/
ble_error_t nRF5xGap::setInitiatorPolicyMode(Gap::InitiatorPolicyMode_t mode)
{
    return BLE_ERROR_NOT_IMPLEMENTED;
}

/**************************************************************************/
/*!
    @brief  Get the current advertising policy filter mode.

    @returns    The advertising policy filter mode.

    @section EXAMPLE

    @code

    @endcode
*/
/**************************************************************************/
Gap::AdvertisingPolicyMode_t nRF5xGap::getAdvertisingPolicyMode(void) const
{
    return advertisingPolicyMode;
}

/**************************************************************************/
/*!
    @brief  Get the current scanning policy filter mode.

    @returns    The scanning policy filter mode.

    @section EXAMPLE

    @code

    @endcode
*/
/**************************************************************************/
Gap::ScanningPolicyMode_t nRF5xGap::getScanningPolicyMode(void) const
{
    return scanningPolicyMode;
}

/**************************************************************************/
/*!
    @brief  Get the current initiator policy filter mode.

    @returns    The initiator policy filter mode.

    @note   Currently initiator filtering using the whitelist is not
            implemented in this module.

    @section EXAMPLE

    @code

    @endcode
*/
/**************************************************************************/
Gap::InitiatorPolicyMode_t nRF5xGap::getInitiatorPolicyMode(void) const
{
    return Gap::INIT_POLICY_IGNORE_WHITELIST;
}

/**************************************************************************/
/*!
    @brief  Helper function used to populate the ble_gap_whitelist_t that
            will be used by the SoftDevice for filtering requests.

    @returns    \ref ble_error_t

    @retval     BLE_ERROR_NONE
                Everything executed properly

    @retval     BLE_ERROR_INVALID_STATE
                The internal stack was not initialized correctly.

    @note  Both the SecurityManager and Gap must initialize correctly for
           this function to succeed.

    @note  This function is needed because for the BLE API the whitelist
           is just a collection of keys, but for the stack it also includes
           the IRK table.

    @section EXAMPLE

    @code

    @endcode
*/
/**************************************************************************/
ble_error_t nRF5xGap::generateStackWhitelist(ble_gap_whitelist_t &whitelist)
{
    ble_gap_whitelist_t  whitelistFromBondTable;
    ble_gap_addr_t      *addressPtr[1];
    ble_gap_irk_t       *irkPtr[YOTTA_CFG_IRK_TABLE_MAX_SIZE];

    nRF5xSecurityManager& securityManager = (nRF5xSecurityManager&) nRF5xn::Instance(0).getSecurityManager();

    if (securityManager.hasInitialized()) {
        /* We do not care about the addresses, set the count to 0 */
        whitelistFromBondTable.addr_count = 0;
        /* The Nordic SDK will return a failure if we set pp_addr to NULL */
        whitelistFromBondTable.pp_addrs   = addressPtr;
        /* We want all the IRKs we can get because we do not know which ones match the addresses */
        whitelistFromBondTable.irk_count  = YOTTA_CFG_IRK_TABLE_MAX_SIZE;
        whitelistFromBondTable.pp_irks    = irkPtr;

        /* Use the security manager to get the IRKs from the bond table */
        ble_error_t error = securityManager.createWhitelistFromBondTable(whitelistFromBondTable);
        if (error != BLE_ERROR_NONE) {
            return error;
        }
    } else  {
        /**
         * If there is no security manager then we cannot access the bond table,
         * so disable IRK matching
         */
        whitelistFromBondTable.addr_count = 0;
        whitelistFromBondTable.irk_count  = 0;
    }

    /**
     * For every private resolvable address in the local whitelist check if
     * there is an IRK for said address in the bond table and add it to the
     * local IRK list.
     */
    whitelist.irk_count  = 0;
    whitelist.addr_count = 0;
    for (uint8_t i = 0; i < whitelistAddressesSize; ++i) {
        if (whitelistAddresses[i].addr_type == BLEProtocol::AddressType::RANDOM_PRIVATE_RESOLVABLE) {
            /* Test if there is a matching IRK for this private resolvable address */
            for (uint8_t j = 0; j < whitelistFromBondTable.irk_count; ++j) {
                if (securityManager.matchAddressAndIrk(&whitelistAddresses[i], whitelistFromBondTable.pp_irks[j])) {
                    /* Found the corresponding IRK, add it to our local whitelist */
                    whitelist.pp_irks[whitelist.irk_count] = whitelistFromBondTable.pp_irks[j];
                    whitelist.irk_count++;
                    /* Make sure we do not look at this IRK again */
                    if (j != whitelistFromBondTable.irk_count - 1) {
                        /**
                         * This is not the last IRK, so replace the pointer
                         * with the last pointer in the array
                         */
                        whitelistFromBondTable.pp_irks[j] =
                            whitelistFromBondTable.pp_irks[whitelistFromBondTable.irk_count - 1];
                    }
                    /**
                     * If the IRK is the last pointer in the array simply
                     * decrement the total IRK count
                     */
                    whitelistFromBondTable.irk_count--;
                    break;
                }
            }
        } else {
            /* Include the address into the whitelist */
            whitelist.pp_addrs[whitelist.addr_count] = &whitelistAddresses[i];
            whitelist.addr_count++;
        }
    }

    return BLE_ERROR_NONE;
}
